
# âš¡ Loading Structured Data & Creating Temporary Views in Spark SQL

Spark SQL allows structured data processing using **DataFrames** and **temporary views**.

---

## ðŸ“‚ Dataset (`employees.csv`)

```text
id,name,dept,salary
1,Alice,HR,45000
2,Bob,IT,60000
3,Charlie,IT,70000
4,David,Finance,80000
````

---

## ðŸ”¹ Step 1: Load Structured Dataset (CSV)

Start **Spark Shell** and load the dataset:

```scala
val df = spark.read
  .option("header", "true")
  .option("inferSchema", "true")
  .csv("employees.csv")
```

---

## ðŸ”¹ Step 2: Inspect Dataset Structure

### View Schema

```scala
df.printSchema()
```

### Preview Records

```scala
df.show()
```

---

## ðŸ”¹ Step 3: Create Temporary View

```scala
df.createOrReplaceTempView("employees")
```

---

## ðŸ”¹ Step 4: Query Temporary View

```scala
spark.sql("SELECT * FROM employees").show()
```

---

## âœ… Output Verification

```text
+---+-------+--------+------+
|id | name  | dept   |salary|
+---+-------+--------+------+
|1  |Alice  |HR      |45000 |
|2  |Bob    |IT      |60000 |
|3  |Charlie|IT      |70000 |
|4  |David  |Finance |80000 |
+---+-------+--------+------+
```

## PySpark

In [1]:
# ==========================================
# Spark SQL - Random Structured Dataset
# Create Temporary View
# ==========================================

import numpy as np
import pandas as pd
from pyspark.sql import SparkSession
from pyspark.sql.functions import col

# -------------------------------
# 1ï¸âƒ£ Create Spark Session
# -------------------------------
spark = SparkSession.builder \
    .appName("SparkSQLTemporaryViewExample") \
    .getOrCreate()

# -------------------------------
# 2ï¸âƒ£ Generate Random Structured Data
# -------------------------------

np.random.seed(42)

n_rows = 100

data = {
    "employee_id": np.arange(1, n_rows + 1),
    "department": np.random.choice(["HR", "IT", "Sales", "Finance"], n_rows),
    "age": np.random.randint(22, 60, n_rows),
    "salary": np.random.randint(30000, 120000, n_rows),
    "experience_years": np.random.randint(1, 20, n_rows)
}

# Convert to Pandas DataFrame
pdf = pd.DataFrame(data)

# -------------------------------
# 3ï¸âƒ£ Convert Pandas â†’ Spark DataFrame
# -------------------------------
df = spark.createDataFrame(pdf)

print("=== Sample Data ===")
df.show(5)

# -------------------------------
# 4ï¸âƒ£ Create Temporary View
# -------------------------------
df.createOrReplaceTempView("employees")

print("\nTemporary View 'employees' created successfully!")

# -------------------------------
# 5ï¸âƒ£ Run Spark SQL Queries
# -------------------------------

# Query 1: Average salary by department
print("\n=== Average Salary by Department ===")
spark.sql("""
    SELECT department,
           ROUND(AVG(salary), 2) AS avg_salary
    FROM employees
    GROUP BY department
""").show()

# Query 2: Employees with salary > 80000
print("\n=== High Salary Employees (> 80000) ===")
spark.sql("""
    SELECT employee_id, department, salary
    FROM employees
    WHERE salary > 80000
""").show()

# Query 3: Count employees by department
print("\n=== Employee Count by Department ===")
spark.sql("""
    SELECT department,
           COUNT(*) AS total_employees
    FROM employees
    GROUP BY department
""").show()

# Query 4: Experienced employees (> 10 years)
print("\n=== Experienced Employees (> 10 years) ===")
spark.sql("""
    SELECT employee_id, department, experience_years
    FROM employees
    WHERE experience_years > 10
""").show()

# -------------------------------
# Stop Spark
# -------------------------------
spark.stop()

=== Sample Data ===
+-----------+----------+---+------+----------------+
|employee_id|department|age|salary|experience_years|
+-----------+----------+---+------+----------------+
|          1|     Sales| 39| 98840|              18|
|          2|   Finance| 47| 84384|               2|
|          3|        HR| 55| 81005|               3|
|          4|     Sales| 31| 76576|              16|
|          5|     Sales| 57| 69353|               9|
+-----------+----------+---+------+----------------+
only showing top 5 rows

Temporary View 'employees' created successfully!

=== Average Salary by Department ===
+----------+----------+
|department|avg_salary|
+----------+----------+
|     Sales|  77183.79|
|        HR|  73598.65|
|   Finance|  72076.07|
|        IT|  75066.69|
+----------+----------+


=== High Salary Employees (> 80000) ===
+-----------+----------+------+
|employee_id|department|salary|
+-----------+----------+------+
|          1|     Sales| 98840|
|          2|   Finance| 84384|
|          3|        HR| 81005|
|          6|   Finance| 92003|
|          7|        HR|113211|
|          8|        HR| 82733|
|          9|     Sales| 95318|
|         10|        IT|119474|
|         12|     Sales| 97172|
|         13|     Sales|115616|
|         18|   Finance| 85680|
|         20|     Sales|117092|
|         21|        IT| 80859|
|         23|        IT|117455|
|         24|   Finance| 93734|
|         25|   Finance|100467|
|         26|        IT| 82662|
|         30|   Finance| 97863|
|         31|        HR| 82083|
|         32|        HR| 95733|
+-----------+----------+------+
only showing top 20 rows

=== Employee Count by Department ===
+----------+---------------+
|department|total_employees|
+----------+---------------+
|     Sales|             24|
|        HR|             20|
|   Finance|             30|
|        IT|             26|
+----------+---------------+


=== Experienced Employees (> 10 years) ===
+-----------+----------+----------------+
|employee_id|department|experience_years|
+-----------+----------+----------------+
|          1|     Sales|              18|
|          4|     Sales|              16|
|         10|        IT|              14|
|         11|     Sales|              16|
|         15|   Finance|              17|
|         17|   Finance|              16|
|         18|   Finance|              12|
|         19|   Finance|              19|
|         20|     Sales|              14|
|         23|        IT|              13|
|         24|   Finance|              19|
|         28|        IT|              15|
|         31|        HR|              16|
|         32|        HR|              19|
|         35|        IT|              17|
|         36|        HR|              17|
|         37|   Finance|              12|
|         38|        HR|              14|
|         43|        IT|              17|
|         44|   Finance|              14|
+-----------+----------+----------------+
only showing top 20 rows